APIs/app/controllers/enqs_controller.rb

SELECT * FROM `enqs`
---
  def index
    @enqs = Enq.all