dapi/app/controllers/answers_controller.rb

SELECT `campaigns`.* FROM `campaigns` WHERE (((`campaigns`.`enq_id` = 'PlusOneEnqID')))
SELECT `enq_questions`.* FROM `enq_questions` WHERE (((`enq_questions`.`enq_page_id` = 'PlusOneSPEnqPage1')))
DELETE FROM `answers` WHERE `answers`.`campaign_id` = 'PlusOneCampaignID' AND `answers`.`enq_question_id` IN ('PlusOneSPEnqQuestion1') AND `answers`.`user_id` = 'nadai1'
SELECT `enq_faces`.* FROM `enq_faces` WHERE (((`enq_faces`.`uuid` = 'PlusOneSPEnqFaceID')))
SELECT `enq_pages`.* FROM `enq_pages` WHERE `enq_pages`.`uuid` = 'PlusOneSPEnqPage1' LIMIT 1
SELECT `enqs`.* FROM `enqs` WHERE (((`enqs`.`uuid` = 'PlusOneEnqID')))
---
  def create
    page = EnqPage.
      includes([{:enq_questions => [{:question => :choices}, :branches]}, {:enq_face => {:enq => :campaigns}}]).
      find_by_uuid(params[:page_id])
    raise NotFoundException.new PAGE_DOES_NOT_EXIST if page.nil?
    raise NotFoundException.new ID_MISS_MATCH_PAGE if page.enq_face.enq_id != params[:enq_id]
    raise NotFoundException.new ID_MISS_MATCH_CAMPAIGN unless page.enq_face.enq.campaigns.any? {|c| c.mid == params[:campaign_id]}
    answers = params.
      select{|k, v| k.start_with? "answer_"}.
      each_with_object({}){|(k, v), a| n = k[7..-1].to_i; a[n] = [[v].flatten(1), page.enq_questions.find{|q| q.num == n}]}
    raise NotFoundException.new ID_MISS_MATCH_QUESTION if answers.any?{|k, (v, q)| q.nil?}
    raise BadRequestException.new REQUIRED_QUESTION unless page.enq_questions.select{|q| q.question.required}.all?{|q| answers.has_key? q.num}
    raise BadRequestException.new IMVALID_QUESTION unless answers.all?{|k, (v, q)| valid?(k, v, q)}
    Answer.delete_all(:campaign_id => params[:campaign_id], :enq_question_id => page.enq_questions.map(&:uuid), :user_id => params[:uid])