dapi/app/controllers/answers_controller.rb

SELECT `answers`.* FROM `answers`
---
  def index
    @answers = Answer.all

SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1
---
  def show
    @answer = Answer.find(params[:id])

INSERT INTO `answers` (`answer`, `campaign_id`, `enq_question_id`, `updated_at`, `updated_by`, `user_agent`, `user_id`, `uuid`) VALUES ('男性', 'PlusOneCampaignID', 'PlusOneSPEnqQuestion1', '2012-06-24 22:57:15', NULL, 'Mozilla/5.0 (iPhone; CPU iPhone OS 5_1_1 like Mac OS X) AppleWebKit/534.46 (KHTML, like Gecko) Version/5.1 Mobile/9B206 Safari/7534.48.3', 'nadai1', '9d51cafe-2692-4c0c-9371-d3790598cbd8')
---
  def create
    @answer = Answer.new(params[:answer])

    respond_to do |format|
      if @answer.save