dapi/app/controllers/branches_controller.rb

INSERT INTO `branches` (`answer`, `created_at`, `enq_id`, `next_page_id`, `num`, `update_date`, `update_name`, `updated_at`) VALUES ('branch ans', '2012-06-01 10:49:28', 1, 1, 1, '2008-06-01', '石川', '2012-06-01 10:49:28')
---
  def create
    @branche = Branche.new(params[:branche])

    respond_to do |format|
      if @branche.save