dapi/app/controllers/campaigns_controller.rb

  def show
    @campaign = Campaign.find_by_uuid(params[:id], {
      :include => {:enq => :enq_faces},
      :conditions => ["enq_faces.face = ?", params[:face]]})
---
SELECT DISTINCT `campaigns`.mid FROM `campaigns` LEFT OUTER JOIN `enqs` ON `enqs`.`uuid` = `campaigns`.`enq_id` LEFT OUTER JOIN `enq_faces` ON `enq_faces`.`enq_id` = `enqs`.`uuid` WHERE `campaigns`.`mid` = 'PlusOneCampaignID' AND (enq_faces.face = 'SP') LIMIT 1