dapi/app/controllers/enq_questions_controller.rb

  def index
    @enq_questions = EnqQuestion.all
---
SELECT `enq_questions`.* FROM `enq_questions`

  def show
    @enq_question = EnqQuestion.find(params[:id])
---
SELECT `enq_questions`.* FROM `enq_questions` WHERE `enq_questions`.`id` = 1 LIMIT 1

  def create
    @enq_question = EnqQuestion.new(params[:enq_question])

    respond_to do |format|
      if @enq_question.save
---
INSERT INTO `enq_questions` (`created_at`, `enq_id`, `num`, `question_id`, `update_date`, `update_name`, `updated_at`) VALUES ('2012-06-01 10:48:44', 1, 1, 1, '2015-06-01', '石川', '2012-06-01 10:48:44')