dapi/app/controllers/enq_pages_controller.rb

SELECT `enq_pages`.* FROM `enq_pages`
---
  def index
    @enq_pages = EnqPage.all

SELECT `enq_pages`.* FROM `enq_pages` WHERE `enq_pages`.`id` = 1 LIMIT 1
---
  def show
    @enq_id = params[:enq_id]
    @page_id = params[:id]

#   @enq_pages = Enq.find(:all,
#		:include => ["enq_pages","enq_questions"],
#		:conditions => {:enq_id => 1}#params[:enq_id]},
#		)

#	@enq_pages = Question.find(:all,
#		:include => ["enq_questions","choices"],
#		:conditions => {:question_id => 1}#params[@question_id]},
#		)


	@enq_pages = EnqPage.find(:all,
		:include => [{:enq => [{:enq_question => [:question => :choice]}, :answer]}, :branch],
		:conditions => {:enq.page_id => params[:id], :enq.id => 1}#params[:enq_id]}
		)

INSERT INTO `enq_pages` (`created_at`, `description`, `enq_id`, `face`, `next_page_id`, `page_id`, `update_date`, `update_name`, `updated_at`, `wait_until`) VALUES ('2012-06-01 10:47:26', 'ep1', 1, 'PC', 1, 1, '2012-06-01', '石川', '2012-06-01 10:47:26', '2012-06-01 10:47:00')
---
  def create
    @enq_page = EnqPage.new(params[:enq_page])

    respond_to do |format|
      if @enq_page.save