dapi/app/controllers/enq_faces_controller.rb

  def index
    @enq_faces = EnqFace.all
---
SELECT `enq_faces`.* FROM `enq_faces`

  def show
    @enq_face = EnqFace.find(params[:id])
---
SELECT `enq_faces`.* FROM `enq_faces` WHERE `enq_faces`.`id` = 1 LIMIT 1

  def edit
    @enq_face = EnqFace.find(params[:id])
---
SELECT `enq_faces`.* FROM `enq_faces` WHERE `enq_faces`.`id` = 1 LIMIT 1

  def create
    @enq_face = EnqFace.new(params[:enq_face])

    respond_to do |format|
      if @enq_face.save
---
INSERT INTO `enq_faces` (`created_at`, `css`, `enq_id`, `face`, `first_page_id`, `update_date`, `update_name`, `updated_at`, `wait_until`) VALUES ('2012-06-04 08:04:37', 'a', 1, 'iOS', 1, '2012-06-04', 'a', '2012-06-04 08:04:37', '2012-06-04 08:04:00')

  def update
    @enq_face = EnqFace.find(params[:id])

    respond_to do |format|
      if @enq_face.update_attributes(params[:enq_face])
---
SELECT `enq_faces`.* FROM `enq_faces` WHERE `enq_faces`.`id` = 1 LIMIT 1
UPDATE `enq_faces` SET `enq_id` = 6, `updated_at` = '2012-06-04 08:34:17' WHERE `enq_faces`.`id` = 1