dapi/app/controllers/enqs_controller.rb

  def show
    begin
      enq_face = params[:face]

      enq = Enq.find_by_uuid(params[:uuid],
	                         :include => :enq_faces,		# アンケートフェイスからの情報を取得
						     :conditions => ["enq_faces.face = ?", enq_face]	# フェイスを条件として検索する
						     )
---
SELECT DISTINCT `enqs`.uuid FROM `enqs` LEFT OUTER JOIN `enq_faces` ON `enq_faces`.`enq_id` = `enqs`.`uuid` WHERE `enqs`.`uuid` = '6' AND (enq_faces.face = 'iOS') LIMIT 1
SELECT `enq_faces`.* FROM `enq_faces` WHERE (((`enq_faces`.`enq_id` = 6)))