dapi/app/controllers/enqs_controller.rb

  def getEnq
	enq_face = params[:enq_face]
	message = "<p>友達にシェアしよう！</p>"

	begin
      #enq = Enq.find_by_uuid(params[:id]),
	  enq = Enq.find_by_id(params[:id],
							:include => :enq_faces,
							:conditions => ["enq_faces.face = ?", enq_face]
							)
---
SELECT DISTINCT `enqs`.id FROM `enqs` LEFT OUTER JOIN `enq_faces` ON `enq_faces`.`enq_id` = `enqs`.`id` WHERE `enqs`.`id` = 6 AND (enq_faces.face = 'iOS') LIMIT 1

  def index
    @enqs = Enq.all
---
SELECT `enqs`.* FROM `enqs`

  def show
    @enq = Enq.find(params[:id])
---
SELECT `enqs`.* FROM `enqs` WHERE `enqs`.`id` = 1 LIMIT 1

  def edit
    @enq = Enq.find(params[:id])
---
SELECT `enqs`.* FROM `enqs` WHERE `enqs`.`id` = 1 LIMIT 1

  def create
    @enq = Enq.new(params[:enq])

    respond_to do |format|
      if @enq.save
---
INSERT INTO `enqs` (`created_at`, `css`, `description`, `enq_id`, `first_page_id`, `movie`, `status`, `thumbnail`, `title`, `update_date`, `update_name`, `updated_at`) VALUES ('2012-06-01 04:35:36', 'あ', 'あ', 1, 1, 'あ', 0, 'あ', 'あ', '2012-06-01', 'あ', '2012-06-01 04:35:36')

  def update
    @enq = Enq.find(params[:id])

    respond_to do |format|
      if @enq.update_attributes(params[:enq])
---
SELECT `enqs`.* FROM `enqs` WHERE `enqs`.`id` = 1 LIMIT 1
UPDATE `enqs` SET `enq_id` = 7, `updated_at` = '2012-06-01 05:25:23' WHERE `enqs`.`id` = 1

  def destroy
    @enq = Enq.find(params[:id])
    @enq.destroy
---
SELECT `enqs`.* FROM `enqs` WHERE `enqs`.`id` = 1 LIMIT 1
DELETE FROM `enqs` WHERE (`enqs`.`id` = 1)